#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/matthew-mccaskill-credera/learning-pod-lab2/runs/run-vxxsbhxvsaEfu75X

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.az_rg will be created
  + resource "azurerm_resource_group" "az_rg" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "lab2-rg"
    }

  # module.az_law.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "lab2-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.az_law.azurerm_log_analytics_workspace.this["DEMO"] will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + location                           = (known after apply)
      + name                               = (known after apply)
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "lab2-rg"
      + retention_in_days                  = (known after apply)
      + secondary_shared_key               = (sensitive value)
      + sku                                = (known after apply)
      + tags                               = (known after apply)
      + workspace_id                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @matthew-mccaskill-credera, Action: `pull_request`*